#ifndef __ANGLE_TASK_H
#define __ANGLE_TASK_H

/*-----------------------------------------
				 头  文  件  包  含
------------------------------------------*/ 
#include "sys.h"
#include "delay.h"
#include "includes.h"



/*-----------------------------------------
				 宏   定   义
------------------------------------------*/ 


/*-----------------------------------------
				 变  量  声  明   
------------------------------------------*/ 



extern u8 Mode;

/*-----------------------------------------
				 函  数  调  用
------------------------------------------*/ 
char angle_task_init(void* p_arg);
char angle_task_deinit(void* p_arg);

void angle_task(void *p_arg);
#endif

